Repository: CColanjo/tcc-back
Catalog: scheduleAppointment/schedule-appointment-domain/Localize/Resource.*.resx
Languages: es_co

# CurrentPasswordDoesNotMatch
source: The password is incorrect or the new password is invalid.
es_co: La contraseña es incorrecta o la nueva contraseña no es válida.

source: Email content empty.
es_co: El contenido del correo electrónico está vacío.

source: Email template not found.
es_co: Email template no encontrado.

source: Invalid username or password.
es_co: Usuario o contraseña invalido.

source: Passwords are not the same.
es_co: Las contraseñas no son similares.

source: User not found.
es_co: Usuario no encontrado.

source: Cost Center not found.
es_co: Centro de Costo no encontrado.

source: Claim not found.
es_co: Claim no encontrado.

# GroupAlreadyRegistered
source: A group with that name already exists.
es_co: Ya existe un grupo con ese nombre.

# YouMustProvideLeastOnePermission
source: At least one Permission must be provided.
es_co: Se debe proporcionar al menos un permiso.

# UserAlreadyRegistered
source: There is already a user with this registered email.
es_co: Ya existe un usuario con este correo registrado.

source: Email is mandatory.
es_co: El email de usuario es obligatorio.

# MandatoryOneGroup
source: Mandatory to inform at least one group.
es_co: Obligatorio informar al menos a un grupo.

source: Username is mandatory.
es_co: El nombre de usuario es obligatorio.

# CostCenterAlreadyRegistered
source: A Cost Center with that name already exists.
es_co: Ya existe un Centro de Costo con ese nombre.

# ClaimAlreadyRegistered
source: A claim with that name already exists.
es_co: Ya existe una función con ese nombre.

source: Approver not found.
es_co: Aprobador no encontrado.

# ClaimNameIsMandatory
source: Permission name is required.
es_co: Se requiere el nombre del permiso.

# CostCenterNameIsMandatory
source: The Cost Center name is required.
es_co: El nombre del Centro de Costo es obligatorio.

# RoleNameIsMandatory
source: Role name is required.
es_co: El nombre del rol es obligatorio.

# CostCenterMustBeInformed
source: The Cost Center must be informed.
es_co: El centro de costos debe ser informado.

# ApproverMustBeInformed
source: The approver must be informed.
es_co: El aprobador debe ser informado.

# RequestTypeMustBeInformed
source: The request type must be informed.
es_co: El tipo de solicitud debe ser informado.

# BirthDateMustBeInformed
source: The birth date must be informed.
es_co: La fecha de nacimiento debe ser informada.

# DocumentNumberMustBeInformed
source: The document number must be informed.
es_co: El número de documento debe ser informado.

# OriginCityMustBeInformed
source: The origin city must be informed.
es_co: La ciudad de origen debe ser informada.

# DestinationCityMustBeInformed
source: The destination city must be informed.
es_co: La ciudad de destino debe ser informada.

# DepartureMustBeInformed
source: The departure date / time must be informed.
es_co: La fecha / hora de salida debe ser informada.

# LandmarkMustBeInformed
source: A landmark must be informed.
es_co: Un punto de referencia debe ser informado.

# TripReasonMustBeInformed
source: The trip reason must be informed.
es_co: La razón del viaje debe ser informada.

# HealthInsuranceAlreadyRegistered
source: A Health Insurance with that name already exists.
es_co: Ya existe un Plan de Salud con ese nombre.

# HealthInsuranceNameIsMandatory
source: The Health Insurance name is required.
es_co: El nombre del Plan de Salud es obligatorio.

source: Health Insurance not found.
es_co: Health Insurance no encontrado.

# CityAlreadyRegistered
source: A City with that name already exists.
es_co: Ya existe un Ciudad con ese nombre.

# CityNameIsMandatory
source: The City name is required.
es_co: El nombre de Ciudad es obligatorio.

source: City not found.
es_co: Ciudad no encontrado.

# CountryAlreadyRegistered
source: A Country with that name already exists.
es_co: Ya existe un Pais con ese nombre.

# CountryNameIsMandatory
source: The Country name is required.
es_co: El nombre de Pais es obligatorio.

source: Country not found.
es_co: Pais no encontrado.

# SupplierNameIsMandatory
source: Supplier name is required.
es_co: El nombre del proveedor es obligatorio.

# SupplierAlreadyRegistered
source: A supplier with that name already exists.
es_co: Ya existe un proveedor con ese nombre.

# BudgetValueMustBeInformed
source: The budget value must be informed.
es_co: El valor del presupuesto debe ser informado.

# CurrencyNameIsMandatory
source: The currency name is required.
es_co: El nombre de la moneda es obligatorio.

# CurrencyAlreadyRegistered
source: A currency with that name already exists.
es_co: Ya existe una moneda con ese nombre.

source: Currency not found.
es_co: Moneda no encontrada.

# ServiceDescriptionMustBeInformed
source: The service description must be informed.
es_co: La descripción del servicio debe ser informada.

# SupplierUserNotLinked
source: The provider does not have a linked user.
es_co: El proveedor no tiene un usuario vinculado.

# SupplierAttachmentCanNotBeAdded
source: It is not possible to add a new file that is of the same type as a previously added active file.
es_co: No se puede agregar un archivo nuevo que sea del mismo tipo que un archivo activo agregado previamente.

# RequestStatusMustBeInformed
source: The new request status must be informed.
es_co: Se debe informar el nuevo estado de la solicitud.

source: Access denied.
es_co: Acceso denegado.

source: WriteUser
es_co: EscribirUsuario

source: ReadUser
es_co: LeerUsuario

source: WriteCostCenter
es_co: EscribirCentroDeCosto

source: ReadCostCenter
es_co: LeerCentroDeCostos

source: WriteRequest
es_co: EscribirSolicitud

source: ReadRequest
es_co: LeerSolicitud

source: WriteCity
es_co: EscribirCiudad

source: ReadCity
es_co: LeerCiudad

source: WriteCountry
es_co: EscribirPaís

source: ReadCountry
es_co: LeerPaís

source: ReadHealthInsurance
es_co: LeerSeguroDeSalud

source: WriteHealthInsurance
es_co: EscribirSeguroDeSalud

source: WriteCurrency
es_co: EscribirMoneda

source: ReadCurrency
es_co: LeerMoneda

source: WriteSupplier
es_co: EscribirProveedor

source: ReadSupplier
es_co: LeerProveedor

source: WriteRole
es_co: EscribirFunción

source: ReadRole
es_co: LeerFunción

source: WriteClaim
es_co: EscribirPermiso

source: ReadClaim
es_co: LeerPermiso

source: CancelRequest
es_co: CancelarSolicitud

source: ManageRequest
es_co: AdministrarSolicitud

source: AwaitingAttachments
es_co: EsperandoAdjuntos

source: New
es_co: Nuevo

source: InReview
es_co: EnRevisión

source: AwaitingApproval
es_co: EsperandoAprobación

source: Approved
es_co: Aprobado

source: AwaitingManagerApproval
es_co: EsperandoAprobaciónDelGerente

source: Disapproved
es_co: Rechazado

source: Canceled
es_co: Cancelado

source: AwaitingPayment
es_co: EnEsperaDePago

source: Paid
es_co: Pagado

source: Concluded
es_co: Concluido

source: PendingReview
es_co: PendienteRevisión

source: Reviewed
es_co: Revisado

source: InConclusion
es_co: EnConclusión

source: Finished
es_co: Terminado

# RequestCanNotBeUpdated
source: The current status of this request does not allow it to be edited.
es_co: El estado actual de esta solicitud no permite editarla.

# SupplierApprovalEmailContent
source: A review of the data registered for the supplier {supplier-name} was carried out. <br />Process status was: {status}. <br />Attached comment: {comment}.
es_co: Se realizó una revisión de los datos registrados para el proveedor {supplier-name}. <br />El estado del proceso era: {status}. <br />Comentario adjunto: {comment}.

# PortalName
source: Supplier Portal
es_co: Portal de Proveedores

source: Rejected
es_co: Rechazado

# SupplierCanNotBeUpdated
source: This supplier cannot be edited at this time as it has a pending review.
es_co: Este proveedor no se puede editar en este momento ya que tiene una revisión pendiente.

source: Request not found.
es_co: Solicitud no encontrada.

source: No selected supplier found.
es_co: No se ha encontrado ningún proveedor seleccionado.

source: Supplier not registered.
es_co: Proveedor no registrado.

# RequestNotInExpectedStatus
source: Request is not in expected status.
es_co: La solicitud no está en el estado esperado.

source: Supplier not found
es_co: Proveedor no encontrado

# ErrorAttachmentUpdate
source: Attachment update error
es_co: Error de actualización de archivo adjunto

# SupplierApprovalEmailSubject_Approved
source: Approval of supplier registration
es_co: Aprobación de registro de proveedores

# SupplierApprovalEmailSubject_Rejected
source: Disapproval of supplier registration
es_co: Desaprobación de registro de proveedor

# NotApprovalAvailability
source: does not meet the permissions for approving the request.
es_co: no cumple con los permisos para aprobar la solicitud.

# ApprovalRequestRequesterEmailContent
source: The request {Request-Integration-Code} was approved. We send the Purchase Order to the provider for execution. When finished we will send you a new email.
es_co: Se aprobó la solicitud {Request-Integration-Code}. Enviamos la Orden de Compra al proveedor para su ejecución. Cuando termine le enviaremos un nuevo correo electrónico.

# ApprovalRequestSupplierEmailContent
source: You have been selected and approved for an request. Attached is the purchase order.
es_co: Usted ha sido seleccionado y aprobado para una aplicación. Adjunto la orden de compra.

# AwaitingApprovalEmailSubject
source: Awaiting Approval of Request
es_co: Esperando la aprobación del pedido

# AwaitingApprovalRequestEmailContent
source: The request has been {{status}}.
es_co: La solicitud ha sido {{status}}.

# ApprovalRequestEmailSubject
source: Request approval.
es_co: Pedir aprobación.

# DisapprovalRequestRequesterEmailContent
source: The request {Request-Integration-Code} was repproved. Below is the approver's comment. Comment: {Comment} Approver: {User-Name-Approver}
es_co: La solicitud {Request-Integration-Code} quedó rechazada. A continuación se muestra el comentario del aprobador. Comentário: {Comment} Aprovador: {User-Name-Approver}

# NoSsupplierChosen
source: No supplier chosen
es_co: Ningún proveedor elegido

source: Record not found for the given code.
es_co: Registro no encontrado para el código dado.

source: Invalid or missing code.
es_co: Código inválido o faltante.

source: Supplier already registered for the given code
es_co: Proveedor ya registrado para el código dado

source: Invoice not found
es_co: Factura no encontrada

# RetentionNotFound
source: There is no retention information for the selected month.
es_co: No hay información de retención para el mes seleccionado.

# AccountStatusNotFound
source: No values ​​available
es_co: No hay información de facturas registradas para el mes seleccionado.

# PDFPage
source: Page
es_co: Página

# PDFpurchaseOrder
source: Purchase Order
es_co: Orden de Compra

# RequestManagementSupplierAttachmentNotFound
source: Request management attachment not found.
es_co: Archivo adjunto de gestión de solicitudes no encontrado.

source: Envelope
es_co: Mensajería

source: Package
es_co: Paquetería

source: Purchase
es_co: Compra

source: Service
es_co: Servicio

source: Acquisition
es_co: Compra

source: Dispatch
es_co: Envío

source: Trip
es_co: Viaje

# InvoiceAlreadRegisteredForThisRequest
source: Invoice already registered for this request.
es_co: Factura ya registrada para esta solicitud.

source: Invoice Type Is Mandatory.
es_co: El tipo de factura es obligatorio.

# DefaultSystemLog
source: (Log entered by the system)
es_co: (Log ingresado por el sistema)

# RequestInvoicePaid
source: Payment of the request invoice executed.
es_co: Pago(s) da factura da solicitude ejecutado(s).

source: GenerateRetentionFile
es_co: GenerarCertificadoDeRetentión

source: GeneratePaymentReceipt
es_co: GenerarComprobanteDePago

# InvoiceIncorrectStatus
source: Invoice with Incorrect Status
es_co: Estado incorrecto de la factura

source: Invoice Attachment not found.
es_co: Archivo de factura no encontrado.

source: Reproved
es_co: Reprobado

# TotalInvoiceAmountNotEqualReviewItems
source: The total amount of the invoice is different from the total amount of the review items!
es_co: El monto total de la factura es diferente al monto total de los artículos de revisión!

# TotalInvoiceNotEqualTotalItems
source: The total amount of the invoice is different from the total amount of the items.
es_co: El importe total de la factura es diferente al importe total de los artículos.

source: ApproveInvoice
es_co: AprobarFactura

# InvoiceCommentMandatory
source: Invoice Comment is Required.
es_co: Comentario de factura es obligatorio

# InvalidStatus
source: Completion not allowed due to current request status
es_co: No se permite completar debido al estado actual de la solicitud

# InvoiceReportTitle
source: Invoice Report
es_co: Informe de Facturas

# SupplierReportTitle
source: Supplier Report
es_co: Informe de Proveedores

# RequestReportTitle
source: Request Report
es_co: Informe de Solicitudes

source: Comment Not Found
es_co: Comentario no encontrado

# CommentMustBeInformed
source: The comment must be informed
es_co: El comentario debe ser informado
